x = str(input('輸入姓名:'))
y = str(input('輸入年齡:'))
z = str(input('輸入性別:'))


print('指令法:')
a = '姓名\t年齡\t性別\n---------------------------\n%s\t%s\t%s\n___________________________\n'
print(a%(x, y, z))

print('插秧法:')
b = '姓名\t年齡\t性別\n---------------------------\n{}\t{}\t{}\n___________________________\n'
print(b.format(x, y, z))

print('名稱法:')
c = '姓名\t年齡\t性別\n---------------------------\n{q}\t{w}\t{e}\n___________________________\n'
print(c.format(q = x, w = y, e = z))

print('排序法:')
d = '姓名\t年齡\t性別\n---------------------------\n{0}\t{1}\t{2}\n___________________________\n'
print(d.format(x, y, z))
